Revit 2027 API
FabricationPart.SplitStraight Method
Overload List
Name | Description
SplitStraight(XYZ) |  Splits the straight into two at the passed in point.
SplitStraight(Document, ElementId, XYZ) |  Splits the straight into two at the passed in point.
Top
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace